[{
	"versiyon": "Jenerasyon 1 (Mean Eye)",
	"yil": "1992-2000",
	"resimURL": "https://raw.githubusercontent.com/ErdincOTA/hr200044erdincerenalan/main/gc8.jpg",
	"motorGucu": "237HP, 270 Nm",
	"motorHacmi": "1994cm3",
	"detay": "<div><b>Motor: Boxer 4</b><br><b>Motor kodu:</b> -<br><b>Yakıt Tipi:</b> Benzin<br><b>Yakıt Sistemi:</b> MPI<br><b>Motor pozisyonu:</b> Dikey<br><b>Silindir Hacmi:</b> 1994 cm3<br><b>Silindir çapı x Silindir içi vuruş:</b> 92.0 x 75.0 mm<br><b>Valf sayısı:</b> 16<br><b>ValfTürbin:</b> Turbo + Intercooler<br><b>Sıkıştırma Oranı: 8.0</b><br><b>Maksimum beygir gücü:</b> 218 PS veya 215 bhp veya 160 kW @ 560i0 rpm<br><b>Maksimum tork:</b> 290 Nm veya 213 lb.ft @ 4000 rpm<br><b>Çekiş:</b> AWD<br><b>Şanzıman:</b>5 vites Manual</div><br><p>Motor sporları bilgi birikimini ve teknolojisi asfalta yansıtmak isteyen Subaru, bu bilgi birikimini ilk jenerasyondan itibaren Impreza’da sunmaya karar verir. Standart Impreza’nın performans değerleri artırıldığı ve tamamen farklı karakterde karşımıza çıkan bu versiyonların ismi <strong>WRX</strong> olacaktır. Subaru’nun ralli tecrübesinin simgesi olduğu için modele <b>W</b>orld <b>R</b>ally e<b>X</b>perimental’ın harfleri verilir. İlk günden günümüze kadar Subaru’nun motor sporları teknolojilerinin asfalta yansıyan yüzü olan Impreza WRX modelleri, ilk olarak karşımıza <strong>1992</strong> yılında çıkar. <strong>236</strong> beygir güç üreten ilk Subaru Impreza WRX modelinde viraj kabiliyetinin geliştirilmesi için <b>LSD</b> tipi diferansiyele yer verilir. Subaru, bağımsız yarış organizasyonlarında satışa sunulmak üzerine <b>WRX RA</b> modelini de kullanıcılara sunduğunu görüyoruz. Günlük kullanım dışında olan WRX RA’da klima başta olmak üzere birçok donanım çıkartılarak yarış ekipmanlarına yer veriliyor.</p>"
}, {
	"versiyon": "Jenerasyon 2 (Bug Eye)",
	"yil": "2000-2007",
	"resimURL": "https://raw.githubusercontent.com/ErdincOTA/hr200044erdincerenalan/main/bugeye.jpg",
	"motorGucu": "280 HP, 300 Nm",
	"motorHacmi": "1994cm3",
	"detay": "<div><b>Motor: Boxer 4</b><br><b>Motor kodu:</b> -<br><b>Yakıt Tipi:</b> Benzin<br><b>Yakıt Sistemi:</b> MPI<br><b>Motor pozisyonu:</b> Sıralı<br><b>Silindir Hacmi:</b> 1994 cm3<br><b>Silindir çapı x Silindir içi vuruş:</b> 92.0 x 75.0 mm<br><b>Valf sayısı:</b> 16<br><b>ValfTürbin:</b> Turbo + Intercooler<br><b>Sıkıştırma Oranı: 8.0</b><br><b>Maksimum beygir gücü:</b>225 PS or 222 bhp or 165 kW @ 5600 rpm<br><b>Maksimum Tork:</b>300 Nm or 221 lb.ft @ 4000 rpm<br><b>Çekiş:</b> AWD<br><b>Şanzıman:</b>5 vites Manual</div><br><p>Impreza’nın birinci jenerasyonuyla birlikte gerek pistte gerek asfaltta başarılar elde eden Subaru, ikinci jenerasyon Impreza’yı milenyuma giriş hediyesi olarak 2000 yılından itibaren kullanıcılarla buluşturdu. Dış tasarım olarak birinci jenerasyona benzer hatlarla karşımıza çıkan ikinci jenerasyon Impreza’da, birinci jenerasyonda kullanılan platformun yenilenmiş hali kullanılıyor. İkinci jenerasyonun kendi içerisinde iki sefer makyaj geçirerek özgün tasarımına kavuştuğunu görüyoruz. Boyutsal olarak daha büyümüş şekilde karşımıza çıkan ikinci jenerasyonun, sedan versiyonunda 45 mm‘lik uzunluk, 40 mm‘lik genişlik, 22 mm‘lik yükseklik ve 5 mm‘lik aks mesafesi artışı yaşandığını görüyoruz. Bununla birlikte ikinci jenerasyonda karşımıza çıkan önemli altyapısal değişikliklerden biri olarak süspansiyon sistemi oluyor. Süspansiyon sistemi ve torsiyon yapısında iyileştirmeler yapan Subaru ekibinin hem ön hem arkada Mc Person tipi (çoğul salıncaklı) yapıya yer verdiğini görüyoruz. Motor hacimlerinde herhangi bir değişiklik olmayan ikinci jenerasyon Impreza’da ilk jenerasyonda olduğu gibi motor seçenekleri <b>1.5</b> litreden başlayıp <b>2.5</b> litreye kadar değişiklik gösteriyordu. İlk jenerasyonda yer verilen dört ileri otomatik şanzıman devam ederken, beş ileri şanzımana ek olarak altı ileri değerli ünitenin de aileye eklendiğini görüyoruz. İkinci jenerasyon WRX ile birlikte motor teknolojilerinde yeniliğe giden Subaru’nun, Impreza dahilinde VVT (değişken valf zamanlaması) sunan motora yer verdiğini görüyoruz. WRX STI ise sunulduğu pazarlara göre değişiklik göstermekle birlikte maksimum <b>280</b> beygire kadar güç üreten bir motora sahip olarak karşımıza çıkıyor. 2004 yılına gelindiğinde Subaru, Amerika pazarı için ilk STI modelini Detroit Otomobil Fuarı’nda <b>WRX WR</b> adıyla karşımıza çıkarıyor. En büyük rakibi olan Mitsubishi Lancer Evo 8’in tanıtımının 1 ay ardından kullanıcıların karşısına çıkan modelde STI performans parçaları ve altın rengi jant takımı yer alıyor.</p>"

}, {
	"versiyon": "Jenerasyon 2 (Blob Eye)",
	"yil": "2004-2007",
	"resimURL": "https://raw.githubusercontent.com/ErdincOTA/hr200044erdincerenalan/main/blobeye.jpg",
	"motorGucu": "280 HP, 300 Nm",
	"motorHacmi": "1994cm3",
	"detay": "<div><b>Motor: Boxer 4</b><br><b>Motor kodu:</b> -<br><b>Yakıt Tipi:</b> Benzin<br><b>Yakıt Sistemi:</b> MPI<br><b>Motor pozisyonu:</b> Sıralı<br><b>Silindir Hacmi:</b> 1994 cm3<br><b>Silindir çapı x Silindir içi vuruş:</b> 92.0 x 75.0 mm<br><b>Valf sayısı:</b> 16<br><b>ValfTürbin:</b> Turbo + Intercooler<br><b>Sıkıştırma Oranı: 8.0</b><br><b>Maksimum beygir gücü:</b>225 PS or 222 bhp or 165 kW @ 5600 rpm<br><b>Maksimum Tork:</b>300 Nm or 221 lb.ft @ 4000 rpm<br><b>Çekiş:</b> AWD<br><b>Şanzıman:</b>5 vites Manual</div><br><p>İnsanları adeta ikiye bölen \"Bug Eye\" ön yüzün üzerine Subaru, duruma müdahale ederek aracın tasarımında \"Blob Eye\" dönemini başlatmıştı. Yol tutuşun arttırılması adına süspansiyonu da güncellenen otomobilin kabininde de ufak güncellemeler yapılmıştı. Aslında 2004 makyajı, bir sonraki estetik operasyonun da temelini oluşturuyordu.</p>"
}, {
	"versiyon": "Jenerasyon 2 (Hawk Eye)",
	"yil": "2006-2007",
	"resimURL": "https://raw.githubusercontent.com/ErdincOTA/hr200044erdincerenalan/main/hawkeye.jpg",
	"motorGucu": "280 HP, 300 Nm",
	"motorHacmi": "2457 cm3",
	"detay": "<div><b>Motor: Boxer 4</b><br><b>Motor kodu:</b> -<br><b>Yakıt Tipi:</b> Benzin<br><b>Yakıt Sistemi:</b> Indirect Injection<br><b>Motor pozisyonu:</b> Sıralı<br><b>Silindir Hacmi:</b> 2457 cm3<br><b>Silindir çapı x Silindir içi vuruş:</b> 99.5 x 79.0 mm<br><b>Valf sayısı:</b> 16<br><b>ValfTürbin:</b> Turbo + Intercooler<br><b>Sıkıştırma Oranı: 8.0</b><br><b>Maksimum beygir gücü:</b>230 PS or 227 bhp or 169 kW @ 5200 rpm<br><b>Maksimum Tork:</b>320 Nm or 236 lb.ft @ 2800 rpm<br><b>Çekiş:</b> AWD<br><b>Şanzıman:</b>5 vites Manual</div><br><p>Mk2 Subaru Impreza WRX STi'ın gördüğü ikinci makyaj, aracı Japon markanın yeni kimliğine uydurmuştu. Yeni farlar, yeni ızgara ve yeni tampon ile adeta bir ağır makyaj olan Mk2.5+ Impreza WRX STi, marka hayranları arasında \"Hawk Eye\" lakabını kazanmıştı. Subaru, bu makyajla birlikte motor hacmini de <b>2.0</b> litreden <b>2.5</b> litreye çıkarmanın yanında şasi ve fren alanında güncellemeler yapmıştı.</p>"
}, {
	"versiyon": "Jenerasyon 3 (Stink Eye)",
	"yil": "2007-2011",
	"resimURL": "https://raw.githubusercontent.com/ErdincOTA/hr200044erdincerenalan/main/stinkeye.jpg",
	"motorGucu": "296 HP, 407 Nm",
	"motorHacmi": "2457 cm3",
	"detay": "<div><b>Motor: Boxer 4</b><br><b>Motor kodu:</b> -<br><b>Yakıt Tipi:</b> Benzin<br><b>Yakıt Sistemi:</b> Indirect Injection<br><b>Motor pozisyonu:</b> Sıralı<br><b>Silindir Hacmi:</b>2457 cm3<br><b>Silindir çapı x Silindir içi vuruş:</b>99.5 x 79 mm<br><b>Valf sayısı:</b> 16<br><b>ValfTürbin:</b> Twin Scroll Turbo + Intercooler<br><b>Sıkıştırma Oranı: 8.2</b><br><b>Maksimum beygir gücü:</b>300 PS or 296 bhp or 221 kW @ 6000 rpm<br><b>Maksimum Tork:</b>407 Nm or 300 lb.ft @ 4000 rpm<br><b>Çekiş:</b> AWD<br><b>Şanzıman:</b>6 vites Manual</div><br><p>Impreza ailesinin en güçlüsü WRX STI yeni üçüncü jenerasyonuyla ilk kez 2007 Tokyo Otomobil Fuarı‘nda boy gösterdi. Japonya’da 2.0 litre hacimli <b>twin scroll turbo</b> motoruyla sunulan WRX STI’nin bu versiyonu yaklaşık <b>304</b> beygir güç ve <b>422</b> nm tork değerine sahipti. Sunulduğu pazarlara göre değişiklik gösteren üçüncü jenerasyon WRX STI’de <b>2.5</b> litre hacim ve tek turbo beslemeli motor seçeneğinin de sunulduğunu görüyoruz. Bu versiyon ise <b>295</b> beygir güç ve <b>407</b> nm tork değerine sahip olarak kayıtlardaki yerini koruyor. Motorlarla birlikte yeni nesil STI modelinde elektronik modifikasyon olarak nitelendirebileceğimiz, Subaru’nun “Akıllı Sürüş” (SI-Drive) adını verdiği sisteme verildiğini görüyoruz. Bu sistemle birlikte <b>ESP</b> özelliğinin, kullanıcının isteği dahilinde “özgürleşmenin anahtarı” olarak kapatılmasına olanak sağlandığını ve sürüş modu seçeneklerini sistem dahilinde sunulan özellikler arasında. Siste, Normal, Sport ve Sport+ olarak değişen sürüş modları ve diferansiyel kilidinin sürücü tarafından belirlenmesine imkan veriyor.</p>"
}, {
	"versiyon": "Jenerasyon 4 (Evo Eye)",
	"yil": "2011-2016",
	"resimURL": "https://raw.githubusercontent.com/ErdincOTA/hr200044erdincerenalan/main/evoeye.jpg",
	"motorGucu": "305 HP, 290 Nm",
	"motorHacmi": "2457 cm3",
	"detay": "<div><b>Motor: Boxer 4</b><br><b>Motor kodu:</b> -<br><b>Yakıt Tipi:</b> Benzin<br><b>Yakıt Sistemi:</b> Indirect Injection<br><b>Motor pozisyonu:</b> Sıralı<br><b>Silindir Hacmi:</b>2457 cm3<br><b>Silindir çapı x Silindir içi vuruş:</b>99.5 x 79 mm<br><b>Valf sayısı:</b> 16<br><b>ValfTürbin:</b> Twin Scroll Turbo + Intercooler<br><b>Sıkıştırma Oranı: 8.2</b><br><b>Maksimum beygir gücü:</b>314 PS or 310 bhp or 227 kW @ 6000 rpm<br><b>Maksimum Tork:</b>394 Nm or 290.6 lb.ft @ 4000 rpm<br><b>Çekiş:</b> AWD<br><b>Şanzıman:</b>6 vites Manual</div><br><p>Impreza’nın dördüncü jenerasyon WRX STI modeli bir önceki jenerasyonda sunulan 2.5 litrelik ünitenin <b>ECU</b> (elektronik) olarak modifiye edilmiş haliyle sunuldu. Yapılan yazılımsal modifikasyonla daha ekonomik hale gelen yeni jenerasyon STI’nin <b>310</b> beygire yükseldiğini görüyoruz. Impreza WRX STI’nin bu versiyondaki tork değeriyse <b>13 nm</b>’lik bir düşüşle <b>394</b> nm tork değerine sahip şekilde karşımıza çıkıyor. 2015 yılında ise Subaru sadece Japonya’da sunmak üzere <b>400</b> adet ürettiği özel versiyon WRX STI modelini <b>S207</b> koduyla satışa sundu. Sınırlı sayıda üretilen bu özel versiyon yaklaşık <b>324</b> beygir güç ve <b>431</b> nm‘lik tork değerine sahip olarak kullanıcılara sunuldu.</p>"
}]
