[{
	"versiyon": "Jenerasyon 1 (Mean Eye)",
	"yil": "1992-2000",
	"resimURL": "https://raw.githubusercontent.com/ErdincOTA/AndroidWRX/main/gc8.jpg",
	"motorGucu": "237HP, 270 Nm",
	"motorHacmi": "1994cm3",
	"detay": "<div><b>Motor: Boxer 4</b><br><b>Motor kodu:</b> -<br><b>Yakıt Tipi:</b> Benzin<br><b>Yakıt Sistemi:</b> MPI<br><b>Motor pozisyonu:</b> Dikey<br><b>Hacmi:</b> 1994 cm3<br><b>Silindir çapı x Silindir içi vuruş:</b> 92.0 x 75.0 mm<br><b>Valf sayısı:</b> 16<br><b>ValfTürbin:</b> Turbo + Intercooler<br><b>Sıkıştırma Oranı: 8.0</b><br><b>Maksimum beygir gücü:</b> 218 PS veya 215 bhp veya 160 kW @ 560i0 rpm<br><b>Maksimum tork:</b> 290 Nm veya 213 lb.ft @ 4000 rpm<br><b>Çekiş:</b> AWD<br><b>Şanzıman:</b>5 vites Manual</div><br><p>Motor sporları bilgi birikimini ve teknolojisi asfalta yansıtmak isteyen Subaru, bu bilgi birikimini ilk jenerasyondan itibaren Impreza’da sunmaya karar verir. Standart Impreza’nın performans değerleri artırıldığı ve tamamen farklı karakterde karşımıza çıkan bu versiyonların ismi <strong>WRX</strong> olacaktır. Subaru’nun ralli tecrübesinin simgesi olduğu için modele <b>W</b>orld <b>R</b>ally e<b>X</b>perimental’ın harfleri verilir. İlk günden günümüze kadar Subaru’nun motor sporları teknolojilerinin asfalta yansıyan yüzü olan Impreza WRX modelleri, ilk olarak karşımıza <strong>1992</strong> yılında çıkar. <strong>236</strong> beygir güç üreten ilk Subaru Impreza WRX modelinde viraj kabiliyetinin geliştirilmesi için <b>LSD</b> tipi diferansiyele yer verilir. Subaru, bağımsız yarış organizasyonlarında satışa sunulmak üzerine <b>WRX RA</b> modelini de kullanıcılara sunduğunu görüyoruz. Günlük kullanım dışında olan WRX RA’da klima başta olmak üzere birçok donanım çıkartılarak yarış ekipmanlarına yer veriliyor.</p>"
}, {
	"versiyon": "Jenerasyon 2 (Bug Eye)",
	"yil": "2000-2007",
	"resimURL": "https://raw.githubusercontent.com/ErdincOTA/AndroidWRX/main/bugeye.jpg",
	"motorGucu": "280HP",
	"motorHacmi": "1994cm3",
	"detay": "<div><b>Motor: Boxer 4</b><br><b>Motor kodu:</b> -<br><b>Yakıt Tipi:</b> Benzin<br><b>Yakıt Sistemi:</b> MPI<br><b>Motor pozisyonu:</b> Dikey<br><b>Hacmi:</b> 1994 cm3<br><b>Silindir çapı x Silindir içi vuruş:</b> 92.0 x 75.0 mm<br><b>Valf sayısı:</b> 16<br><b>ValfTürbin:</b> Turbo + Intercooler<br><b>Sıkıştırma Oranı: 8.0</b><br><b>Maksimum beygir gücü:</b>225 PS or 222 bhp or 165 kW @ 5600 rpm<br><b>Çekiş:</b> AWD<br><b>Şanzıman:</b>5 vites Manual</div><br><p>Impreza’nın birinci jenerasyonuyla birlikte gerek pistte gerek asfaltta başarılar elde eden Subaru, ikinci jenerasyon Impreza’yı milenyuma giriş hediyesi olarak 2000 yılından itibaren kullanıcılarla buluşturdu. Dış tasarım olarak birinci jenerasyona benzer hatlarla karşımıza çıkan ikinci jenerasyon Impreza’da, birinci jenerasyonda kullanılan platformun yenilenmiş hali kullanılıyor. İkinci jenerasyonun kendi içerisinde iki sefer makyaj geçirerek özgün tasarımına kavuştuğunu görüyoruz. Boyutsal olarak daha büyümüş şekilde karşımıza çıkan ikinci jenerasyonun, sedan versiyonunda 45 mm‘lik uzunluk, 40 mm‘lik genişlik, 22 mm‘lik yükseklik ve 5 mm‘lik aks mesafesi artışı yaşandığını görüyoruz. Bununla birlikte ikinci jenerasyonda karşımıza çıkan önemli altyapısal değişikliklerden biri olarak süspansiyon sistemi oluyor. Süspansiyon sistemi ve torsiyon yapısında iyileştirmeler yapan Subaru ekibinin hem ön hem arkada Mc Person tipi (çoğul salıncaklı) yapıya yer verdiğini görüyoruz. Motor hacimlerinde herhangi bir değişiklik olmayan ikinci jenerasyon Impreza’da ilk jenerasyonda olduğu gibi motor seçenekleri <b>1.5</b> litreden başlayıp <b>2.5</b> litreye kadar değişiklik gösteriyordu. İlk jenerasyonda yer verilen dört ileri otomatik şanzıman devam ederken, beş ileri şanzımana ek olarak altı ileri değerli ünitenin de aileye eklendiğini görüyoruz. İkinci jenerasyon WRX ile birlikte motor teknolojilerinde yeniliğe giden Subaru’nun, Impreza dahilinde VVT (değişken valf zamanlaması) sunan motora yer verdiğini görüyoruz. WRX STI ise sunulduğu pazarlara göre değişiklik göstermekle birlikte maksimum <b>280</b> beygire kadar güç üreten bir motora sahip olarak karşımıza çıkıyor. 2004 yılına gelindiğinde Subaru, Amerika pazarı için ilk STI modelini Detroit Otomobil Fuarı’nda <b>WRX WR</b> adıyla karşımıza çıkarıyor. En büyük rakibi olan Mitsubishi Lancer Evo 8’in tanıtımının 1 ay ardından kullanıcıların karşısına çıkan modelde STI performans parçaları ve altın rengi jant takımı yer alıyor.</p>

}, {
	"versiyon": "Jenerasyon 2 (Blob Eye)",
	"yil": "2004-2007",
	"resimURL": "https://raw.githubusercontent.com/ErdincOTA/AndroidWRX/main/blobeye.jpg",
	"motorGucu": "280HP",
	"motorHacmi": "1994cm3",
	"detay": "<div><b>Motor: Boxer 4</b><br><b>Motor kodu:</b> -<br><b>Yakıt Tipi:</b> Benzin<br><b>Yakıt Sistemi:</b> MPI<br><b>Motor pozisyonu:</b> Dikey<br><b>Hacmi:</b> 1994 cm3<br><b>Silindir çapı x Silindir içi vuruş:</b> 92.0 x 75.0 mm<br><b>Valf sayısı:</b> 16<br><b>ValfTürbin:</b> Turbo + Intercooler<br><b>Sıkıştırma Oranı: 8.0</b><br><b>Maksimum beygir gücü:</b>225 PS or 222 bhp or 165 kW @ 5600 rpm<br><b>Çekiş:</b> AWD<br><b>Şanzıman:</b>5 vites Manual</div><br><p>İnsanları adeta ikiye bölen \"Bug Eye\" ön yüzün üzerine Subaru, duruma müdahale ederek aracın tasarımında \"Blob Eye\" dönemini başlatmıştı. Yol tutuşun arttırılması adına süspansiyonu da güncellenen otomobilin kabininde de ufak güncellemeler yapılmıştı. Aslında 2004 makyajı, bir sonraki estetik operasyonun da temelini oluşturuyordu.</p>"
}, {
	"versiyon": "GC8",
	"yil": "1999",
	"resimURL": "https://i.pinimg.com/originals/96/73/28/9673287c4fd12cc22c583cf7c9a6665a.jpg",
	"motorGucu": "280HP",
	"motorHacmi": "2000",
	"detay": "ahahahahahahaha"
}, {
	"versiyon": "GC8",
	"yil": "1999",
	"resimURL": "https://i.pinimg.com/originals/96/73/28/9673287c4fd12cc22c583cf7c9a6665a.jpg",
	"motorGucu": "280HP",
	"motorHacmi": "2000",
	"detay": "ahahahahahahaha"
}, {
	"versiyon": "GC8",
	"yil": "1999",
	"resimURL": "https://i.pinimg.com/originals/96/73/28/9673287c4fd12cc22c583cf7c9a6665a.jpg",
	"motorGucu": "280HP",
	"motorHacmi": "2000",
	"detay": "ahahahahahahaha"
}]
